# SetTreeControlItemData

## Description
Sets the user data of the specified item from a tree control.

```pascal
PROCEDURE SetTreeControlItemData(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				nItemID      : INTEGER;
				nUserData    : LONGINT);
```

```python

def vs.SetTreeControlItemData(nDialogID, nComponentID, nItemID, nUserData):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|nItemID|INTEGER||
|nUserData|LONGINT||

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern